Revit 2024 API
RevisionsOnSheetUIServiceData Class
 UI data wrapper for RevisionsOnSheetUIService.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RevisionsOnSheetUIServiceData : IDisposable
Visual Basic
Public Class RevisionsOnSheetUIServiceData _
	Implements IDisposable
Visual C++
public ref class RevisionsOnSheetUIServiceData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevisionsOnSheetUIServiceData
See Also
RevisionsOnSheetUIServiceData Members
Autodesk.Revit.UI Namespace